<?php
  //1.
  for ($i = 1; $i < 101; $i++) {
    if ($i % 3 === 0 && $i % 5 === 0) {
      echo 'FizzBuzz'. '<br>';
    } else if ($i % 5 === 0) {
      echo 'Buzz'. '<br>';
    } else if ($i % 3 === 0) {
      echo 'Fizz'. '<br>';
    } else {
      echo $i. '<br>';
    }
  }


  echo '<br>';
  //2.
  $array = array();
  array_push($array,2);
  for($i = 3;$i <= 10000;$i++){
    $k = true;
    for($j = 2;$j < $i;$j++){
      if ($i % $j == 0){
        $k = false;
      }
    }
    if ($k == true){
      array_push($array,$i);
    }
  }
  foreach($array as $val){
  print($val . '<br>');
  }


  echo '<br>';
  //3.
  $LikeBooks = [
    '漫画'=>[
      '男性作家'=>[
        '短編'=>[
          '日本伝統'=>[
            '将棋'=>['リボーンの棋士'],
            '刀鍛冶'=>['カナヤゴ']
          ],
          'SF'=>[
            'サイボーグ'=>['銃夢'],
            'パラサイト'=>['寄生獣']
          ],
        ],
        '長編'=>[
          'スポーツ'=>[
            '野球'=>['タッチ'],
            'ゴルフ'=>['ライジングインパクト']
          ],
          'SF'=>[
            'ロボット'=>['新世紀エヴァンゲリオン'],
            '巨人'=>['進撃の巨人']
          ]
        ]
      ],
      '女性作家'=>[
        '短編'=>[
          '音楽'=>[
            'ジャズ'=>['坂道のアポロン'],
            '食'=>['いぶり暮らし']
          ],
          '恋愛'=>[
            '同棲'=>['喰う寝るふたり 住むふたり'],
            'ヒューマンドラマ'=>['ハルコイ']
          ]
        ],
        '長編'=>[
          '日本伝統'=>[
            '百人一首'=>['ちはやふる'],
            '琴'=>['この音とまれ!']
          ],
          'SF'=>[
            '戦争'=>['図書館戦争'],
            '旅'=>['不滅のあなたへ']
          ]
        ]
      ]
    ],
    '小説'=>[
      '女性作家'=>[
        '短編'=>[
          '現代'=>[
            'ヒューマンドラマ'=>['阪急電車'],
            '障害'=>['レインツリーの国']
          ]
        ],
        '長編'=>[
          'SF'=>[
            '戦争'=>['図書館戦争'],
            '恋愛'=>['青い月の夜、もう一度彼女に恋をする']
          ],
          'フィクション'=>[
            '自衛隊'=>['塩の街', '空の中', '海の底', '空飛ぶ広報室'],
            '恋愛'=>['県庁おもてなし課']
          ],
        ]
      ],
      '男性作家'=>[
        '長編'=>[
          '歴史'=>[
            '戦争'=>['永遠の0']
          ],
          'SF'=>[
            '入れ替わり'=>['民王']
          ]
        ],
        '短編'=>[
          'なし'=>[
            'なし'=>['なし']
          ]
        ]
      ]
    ]
  ];
  $LikeBook = $LikeBooks['漫画']['女性作家']['長編']['日本伝統']['百人一首'];
  var_dump($LikeBook);

?>